namespace ERP.Library.Enums.Login
{
    public enum PermissionType
    {
        登入權限 = 100000,
        權限管理 = 100001,
        帳號管理 = 100002,

        員工資料 = 1000,
        員工修改 = 10000,
        員工刪除 = 10001,

        請假單 = 1030,
        請假單修改 = 10300,
        請假單刪除 = 10301,

        公文 = 1040,
        公文修改 = 10400,
        公文刪除 = 10401,

        公司部門資料 = 1100,
        部門修改 = 11000,
        部門刪除 = 11001,

        部門成員管理 = 1101,
        部門管理修改 = 11010,
        部門管理刪除 = 11011,

        零用金 = 1200,
        零用金修改 = 12000,
        零用金刪除 = 12001,

        登入紀錄 = 1700,
        操作紀錄 = 1710,

        客戶資料 = 2000,
        客戶修改 = 20000,
        客戶刪除 = 20001,

        報價單 = 3000,
        報價單修改 = 30000,
        報價單刪除 = 30001,

        採購單 = 3040,
        採購單修改 = 30400,
        採購單刪除 = 30401,

        合約單 = 3050,
        合約單修改 = 30500,
        合約單刪除 = 30501,

        庫存 = 4000,
        庫存修改 = 40000,
        庫存刪除 = 40001,
        金額顯示 = 40999,

        進貨單 = 4010,
        進貨單修改 = 40100,
        進貨單刪除 = 40101,

        出貨單 = 4020,
        出貨單修改 = 40200,
        出貨單刪除 = 40201,
        倉管出貨所有權限 = 40299,

        供應商 = 4060,
        供應商修改 = 40600,
        供應商刪除 = 40601,

        派工單 = 5000,
        派工單修改 = 50000,
        派工單刪除 = 50001,

        送修單 = 5050,
        送修單修改 = 50500,
        送修單刪除 = 50501,

        財務權限 = 6000,
        會計權限 = 6001,
    }
}
