namespace ERP.Library.Enums.Login
{
    public enum PermissionType
    {
        最高權限 = 100000,
        帳號管理 = 100001,

        員工檢視 = 1000,
        員工編輯 = 10000,
        員工刪除 = 10001,

        請假單檢視 = 1030,
        請假單編輯 = 10300,
        請假單刪除 = 10301,

        公文檢視 = 1040,
        公文編輯 = 10400,
        公文刪除 = 10401,

        部門檢視 = 1100,
        部門編輯 = 11000,
        部門刪除 = 11001,

        部門成員檢視 = 1101,
        部門管理編輯 = 11010,
        部門管理刪除 = 11011,

        零用金檢視 = 1200,
        零用金編輯 = 12000,
        零用金刪除 = 12001,

        登入紀錄 = 1700,
        操作紀錄 = 1710,

        客戶檢視 = 2000,
        客戶編輯 = 20000,
        客戶刪除 = 20001,

        報價單檢視 = 3000,
        報價單編輯 = 30000,
        報價單刪除 = 30001,

        採購單檢視 = 3040,
        採購單編輯 = 30400,
        採購單刪除 = 30401,

        合約單檢視 = 3050,
        合約單編輯 = 30500,
        合約單刪除 = 30501,

        庫存檢視 = 4000,
        庫存編輯 = 40000,
        庫存刪除 = 40001,
        金額顯示 = 40999,

        進貨單檢視 = 4010,
        進貨單編輯 = 40100,
        進貨單刪除 = 40101,

        出貨單檢視 = 4020,
        出貨單編輯 = 40200,
        出貨單刪除 = 40201,
        倉管出貨所有權限 = 40299,

        供應商檢視 = 4060,
        供應商編輯 = 40600,
        供應商刪除 = 40601,

        派工單檢視 = 5000,
        派工單編輯 = 50000,
        派工單刪除 = 50001,

        送修單檢視 = 5050,
        送修單編輯 = 50500,
        送修單刪除 = 50501,

        財務權限 = 6000,
        會計權限 = 6001,
    }
}
